{
  "paper_id": "1405.2584",
  "title": "Sentiment Survey",
  "category": "ecommerce_evaluation",
  "status": "success",
  "summary": "This PDF is a short survey paper by Rahul Tejwani (University at Buffalo) that overviews sentiment analysis, also called opinion mining, as the use of NLP and text analysis to identify and extract subjective information from user-generated text such as product reviews, tweets, and social media. It motivates the area with consumer decision-making and business needs like evaluating campaigns or product launches via customer sentiment, and frames major research directions as sentiment classification, feature-based sentiment classification, and opinion summarization.\n\nIt emphasizes practical challenges that make sentiment harder than standard text mining: opinions can be expressed indirectly or contextually (including sarcasm, irony, negation, topic shifts, and intra-sentential reversals), and the same word can flip polarity depending on situation. It also notes that reviews often mix positive and negative statements and that short informal text can lack context or pack multiple opinions into one sentence, pushing the need for more fine-grained analysis beyond whole-document labels.  \n*can someone sit through the movie is extremely negative sentiment yet contains no negative lexographic word.*  \n\nThe paper organizes methods and resources into a few recurring buckets:  \n- **Task levels:** document-level (overall polarity, often treated as a text classification problem), sentence-level (polarity per sentence plus subjectivity detection), and feature or aspect-level (opinions tied to specific product features and targets).  \n- **Key enabling step:** subjectivity vs objectivity classification to filter irrelevant sentences and reduce processing overhead, with early work cited using techniques like minimum cuts and SVMs for extracting subjective content.  \n- **Data sources:** blogs and review sites, curated review datasets (movie reviews, multi-domain Amazon reviews, customer review datasets), and annotated corpora like MPQA; plus lexical resources such as SentiWordNet, LIWC, and the General Inquirer.  \n- **Approaches mentioned:** supervised ML methods (Naive Bayes, SVM, Maximum Entropy) with features like term frequency, adjectives from POS tagging, negation and dependency cues, plus lexicon-based methods, emoticon detection, graph-based techniques, and topic modeling. It closes by highlighting broad applications in social media monitoring and business analytics, and reports that some lexicon or dictionary-based approaches achieve over 70 percent accuracy on standard datasets.  \n*The task of Sentimant Analysis can be broadly classified into three levels: documentlevel,sentencelevel,andfeature based approaches.*",
  "file_path": "/Users/rrp/Documents/aicode/data/papers/ecommerce_evaluation/1405.2584_sentiment_survey.pdf"
}