{
  "paper_id": "1702.07158",
  "title": "Next Basket Tars",
  "category": "product_matching",
  "status": "success",
  "summary": "This paper tackles next basket prediction for supermarket customers, aiming to recommend a personalized shopping list for the next purchase. It argues that prior methods fail to jointly capture four drivers of repeat purchasing behavior and introduces Temporal Annotated Recurring Sequences, or TARS, as an adaptive, user-centric pattern representation learned from a single customers transaction history. *Current approaches are not capable to capture at the same time the different factors influencing the customers decision process.*  \n\nTARS represent sequences of itemsets X to Y with a temporal annotation for how long typically passes between X and Y, plus recurrence information describing how many distinct periods the sequence appears in and how often it occurs within each period. The paper defines core constructs such as sequence occurrences, head time lists, intra-time, inter-time, and periods, then proposes a TARS extraction procedure based on an extended FP-Growth style tree that stores temporal and recurrence metadata per node. A key design choice is data-driven parameter estimation per sequence and per customer for maximum inter-time, minimum occurrences per period, and minimum number of recurring periods, using binning heuristics, followed by base-sequence filtering to reduce search space despite TARS lacking anti-monotonicity.\n\nOn top of extracted TARS, the authors build TBP, a parameter-free predictor that selects active TARS by scanning recent consecutive baskets and checking whether observed time gaps fall within each pattern’s temporal range, while tracking how many times each pattern has recently occurred. Item scores are then computed mainly from how far the recent occurrences are from the typical per-period count, augmented by item support, and the top k items are recommended, with k either fixed or personalized to a customers average basket size. Experiments on three retail datasets, including two seven-year Coop variants and the Ta-Feng dataset, show TARS are interpretable and align with intuitive seasonality and repurchase rhythms, and TBP generally outperforms several baselines including user-centric and global models; performance remains stable for up to about 20 future-basket predictions, and reliability stabilizes after roughly 36 weeks of history. *A deep experimentation shows that TARS are able to explain the customer purchase behavior, and that TBP outperforms the state-of-the-art competitors.*",
  "file_path": "/Users/rrp/Documents/aicode/data/papers/product_matching/1702.07158_next_basket_tars.pdf"
}