{
  "paper_id": "1705.07371",
  "title": "Spelling Correction Foreign Lang",
  "category": "product_matching",
  "status": "success",
  "summary": "This paper proposes treating spelling correction as a neural machine translation problem: the misspelled query is a foreign language input, and the corrected query is the translation. Instead of the traditional noisy channel setup with separate language and error models, it directly models the conditional probability of the corrected text given the misspelling using a single end-to-end model, aiming to reduce modeling complexity and eliminate feature engineering and hand tuning.\n\n*In this paper, we reformulated the spelling correction problem as a machine translation task under the encoder-decoder framework.* The approach uses an encoder-decoder architecture built with multi-layer recurrent neural networks, specifically LSTMs, and incorporates an attention mechanism so the decoder can focus on different parts of the encoded input rather than relying on a single fixed-length vector. To handle spelling correction’s effectively unbounded input vocabulary and the burden of pure character-level decoding, it uses byte pair encoding to represent text as subword units, balancing vocabulary size against sequence length and decoder difficulty.\n\nExperiments target e-commerce query correction using internal data. Training pairs are mined automatically from user behavior logs by detecting query reformulations within sessions and then filtering to better match spelling-error patterns, yielding a very large dataset. *Filtering multiple months of data from our data warehouse, we got about 70 million misspelling and spell correction pairs as our training data.* Evaluation uses a human-labeled test set of 4602 queries and beam search decoding; the best variant, BPE encoder to BPE decoder, reaches 62.5% accuracy, competitive with a prior reported 62.0%, while character-heavy variants perform worse. The paper concludes that a simple attention-based seq2seq model trained end-to-end can match strong baselines for query spelling correction without the traditional multi-component architecture and manual feature work.",
  "file_path": "/Users/rrp/Documents/aicode/data/papers/product_matching/1705.07371_spelling_correction_foreign_lang.pdf"
}