{
  "paper_id": "1706.02093",
  "title": "Cascade Ranking",
  "category": "ecommerce_evaluation",
  "status": "success",
  "summary": "The paper describes CLOES, a cascade ranking system designed and deployed for Taobao large scale operational e commerce search, where ranking must be both accurate and fast under heavy traffic. It argues that prior cascade ranking work often assumes smaller compute settings and optimizes too few constraints, while real production search must jointly balance relevance, latency, result set size, and total CPU cost, and should optimize for more than clicks. *This paper presents novel research and thorough study of designing and deploying a Cascade model in a Large-scale Operational E-commerce Search application (CLOES), which deals with hundreds of millions of user queries per day with hundreds of servers.*\n\nCLOES is framed as a supervised learning setup with a multi stage cascade of classifiers, using cheap features early to reject many items and increasingly costly features later to refine the remaining candidates. The objective starts from regularized logistic likelihood, then adds: expected computational cost based on how many items pass each stage, differentiable penalty terms that enforce enough final results and bounded latency, and importance weighting to emphasize purchase over click and to weight transactions by item price via log price. Feature examples and costs illustrate the tradeoff, from simple statistics like sales volume to expensive predictive signals such as deep and wide network scores, plus a query only recalled item count feature used to control stage sizes without changing within stage ordering.\n\nExperiments include an offline benchmark sampled from Taobao search logs in late October 2016 and large scale online A B tests in production. Offline results show the cascade achieves a better accuracy cost tradeoff than a single stage model and a common 2 stage heuristic, with tunable beta controlling efficiency; online results report about 20 percent lower CPU cost than the prior 2 stage baseline, reduced latency, and behavior dependent gains where higher purchase weighting tends to improve orders and GMV while slightly reducing CTR. The paper also analyzes user experience effects across representative hot and long tail queries by pushing hot query latency below a threshold and lifting long tail result counts toward a minimum, and it reports operational benefits during Singles Day 2016 by tuning beta to preserve stability without dropping costly features while maintaining or slightly improving GMV. *the search system should respond in no more than 130 ms, the number of returned products should be at least 200, and the average CPU utilization rate in computer clusters should be below 70%.*",
  "file_path": "/Users/rrp/Documents/aicode/data/papers/ecommerce_evaluation/1706.02093_cascade_ranking.pdf"
}