{
  "paper_id": "1708.05031",
  "title": "Neural Cf",
  "category": "product_matching",
  "status": "success",
  "summary": "This paper proposes Neural Network based Collaborative Filtering, a framework that replaces matrix factorization’s fixed inner product with a learnable neural interaction function for recommendation from implicit feedback. It frames implicit interactions as one class, noisy binary signals, and argues that the inner product can be too restrictive to capture complex user item relationships without using very large latent dimensions that may overfit. *We show that MF can be interpreted as a specialization of NCF*.\n\nNCF is presented as a layered architecture with one hot user and item IDs, an embedding layer that produces user and item latent vectors, and neural collaborative filtering layers that map these vectors to a predicted interaction probability. The paper instantiates NCF with three models:  \n- GMF, a generalized matrix factorization that uses element wise product of embeddings plus a logistic output, showing MF as a special case under constraints  \n- MLP, which concatenates embeddings and applies multiple hidden layers to learn non linear interactions, recommending ReLU over sigmoid and tanh and using a tower shaped network that halves layer size  \n- NeuMF, a fusion that concatenates GMF and MLP representations while allowing separate embeddings, plus a pre training scheme that initializes NeuMF from separately trained GMF and MLP models and then fine tunes with SGD\n\nFor learning, the paper emphasizes a probabilistic view of implicit data and optimizes a log loss with negative sampling, treating recommendation as binary classification rather than squared error regression. Experiments on MovieLens 1M converted to implicit feedback and a filtered Pinterest implicit dataset use leave one out evaluation with 100 sampled non interacted items per user and report HR@10 and NDCG@10: NeuMF performs best overall, GMF and MLP are strong baselines, pre training usually helps NeuMF, and deeper MLPs improve performance compared to shallow or linear variants. *By employing a probabilistic treatment for NCF, we address recommendation with implicit feedback as a binary classification problem.*",
  "file_path": "/Users/rrp/Documents/aicode/data/papers/product_matching/1708.05031_neural_cf.pdf"
}