{
  "paper_id": "1803.00693",
  "title": "Ecommerce Ranking Factor",
  "category": "product_matching",
  "status": "success",
  "summary": "This paper tackles the effectiveness versus efficiency tradeoff in large-scale e-commerce search ranking, arguing that many ranking factors are redundant and that a given search instance often needs only a small, context-dependent subset of factors to preserve ranking quality while reducing latency. It proposes Contextual Factor Selection (CFS), where the system dynamically selects which factors to compute and use for each user-query context, then injects that selection into the ranking score to accelerate the search engine. *a search instance usually requires only a small set of effective factors instead of all factors*\n\nThe core method, RankCFS, frames per-request factor selection as a contextual combinatorial optimization problem that is NP-hard if solved exactly for each context, then transforms it into a sequential decision-making problem solved with reinforcement learning. The ranking model is treated as a black box, and the objective balances a ranking-effectiveness loss defined via distance between the full-factor induced permutation and the selected-factor permutation, plus a weighted computational cost term based on per-factor costs and number of ranked items. RankCFS uses an actor-critic approach (implemented with A3C-style training) with state designs that include the user-query representation and the current factor index, plus reward shaping to mitigate sparse feedback by penalizing costly factor usage and heavily penalizing ranking degradation beyond a threshold.\n\nEmpirically, the paper reports off-line comparisons against norm elimination, l1-based selection, tree-based selection, and F-test selection, showing RankCFS achieves lower pairwise ranking loss while keeping factor usage competitive and reducing weighted factor usage by preferentially dropping expensive factors. It also reports on-line A/B tests on Taobao.com where a small traffic slice is used for evaluation, claiming large latency reductions with minimal business impact, including during high-traffic Singles Day 2017; RankCFS is additionally combined with a cascading approach that reduces the number of items to rank for further gains. *Our method saves approximately 40% average search latency comparing to the control group* The conclusion highlights reinforcement learning as a practical way to learn context-sensitive factor usage policies at scale, and suggests future work on optimizing memory usage and load balancing, plus exploring more end-to-end representations such as pointer-network-style solutions.",
  "file_path": "/Users/rrp/Documents/aicode/data/papers/product_matching/1803.00693_ecommerce_ranking_factor.pdf"
}