{
  "paper_id": "1805.03687",
  "title": "Ecommerce Reviews Rnn",
  "category": "product_matching",
  "status": "success",
  "summary": "This paper studies Womens Clothing E-Commerce Reviews to connect non-text review attributes with customer recommendations and to predict two labels from review text: whether a product is recommended and whether sentiment is negative, neutral, or positive. It combines exploratory statistics and visualization with a bidirectional RNN using LSTM units, motivated by the need to capture context in both directions and to avoid vanilla RNN vanishing-gradient issues. *Understanding customer sentiments is of paramount importance in marketing strategies today.*  \n\nFor the statistical analysis, the author examines distributions and cross-tabs of features such as age, department, division, class name, ratings, recommendation indicator, positive feedback count, and word length. Key findings include an age cluster of highly engaged reviewers around 35 to 44, dominant review volume in general-sized tops and heavily reviewed classes like dresses, knits, and blouses, and a strong association between rating and recommendation. The paper also notes that recommendation and sentiment move together more clearly than rating and sentiment, describing ratings as a fuzzier proxy for sentiment than the recommendation flag. *Results have shown that a recommendation is a strong indicator of a positive sentiment score, and vice-versa.*  \n\nModeling uses Keras with TensorFlow plus numpy and pandas for preprocessing and seaborn and matplotlib for plots; text is cleaned by removing newline delimiters, sentiment labels are generated with an NLTK sentiment analyzer (as a replacement for a simple rating-threshold scheme), and GloVe embeddings represent tokens. Experiments run on a laptop GPU with a 60/20/20 train-validation-test split and fixed hyperparameters (batch size 256, cell size 256, dropout 0.50, 32 epochs, learning rate 1e-3), yielding about 0.88 F1 for recommendation classification and about 0.93 F1 for sentiment classification; however, class imbalance is severe, and per-class results are much weaker for not recommended and for negative and neutral sentiment than for the dominant recommended and positive classes. The conclusion recommends hyperparameter tuning and k-fold cross validation, and suggests comparing against a unidirectional RNN-LSTM to better isolate the benefit of bidirectionality.",
  "file_path": "/Users/rrp/Documents/aicode/data/papers/product_matching/1805.03687_ecommerce_reviews_rnn.pdf"
}