{
  "paper_id": "1903.04263",
  "title": "Ltr Ecommerce",
  "category": "product_matching",
  "status": "success",
  "summary": "The paper studies how to apply learning to rank methods to e-commerce product search, focusing on practical issues that differ from web search: how to represent features that mix relevance and popularity, how to obtain reliable relevance judgments, and how to train with multiple user feedback signals (clicks, add-to-cart, orders, revenue). Using industry query and log data, it first benchmarks common learning to rank and related models and finds LambdaMART performs best across objectives, making it a strong baseline for product ranking.\n\nExperiments then analyze two core feature challenges. Popularity-only product features (sales, reviews, ratings and similar document attributes) significantly improve ranking when combined with relevance features, and LambdaMART can learn a useful balance rather than letting popularity overwhelm relevance. Query attribute sparsity is shown to hurt generalization: because many catalog attributes exist but few appear per query, models trained with all attribute features can struggle on segments with different attribute sets; restricting training to the attribute intersection shared with the target segment improves NDCG@10 in multiple department-based tests.\n\nThe paper also evaluates label quality and objective choice. Crowdsourced relevance ratings are often unreliable for e-commerce because purchase utility depends on fine-grained preferences (brand, price, specs, value), and the study shows many crowd-rated ideal items receive zero or minimal clicks despite high exposure, indicating mismatch with real user behavior. Across feedback signals, click rate is easiest to predict and add-to-cart ratio is hardest, while training on order rate is most robust when tested on other objectives; a practical strategy suggested is to start with click-based training where order data is sparse and shift toward order-based models as orders accumulate.\n\n*Popularity-based features defined solely on product items are very useful and LETOR methods were able to effectively optimize their combination with relevance-based features.*\n\n*Finally, among the multiple feedback signals, the order rate is found to be the most robust training objective, followed by click rate.*",
  "file_path": "/Users/rrp/Documents/aicode/data/papers/product_matching/1903.04263_ltr_ecommerce.pdf"
}