{
  "paper_id": "1910.07099",
  "title": "Esmm Cvr",
  "category": "ecommerce_evaluation",
  "status": "success",
  "summary": "This paper proposes ESM2, a deep multi-task learning model for conversion rate prediction in e-commerce recommender systems that targets two core difficulties: sample selection bias, because CVR models are trained on clicked items but must score all impressions, and data sparsity, because purchases are extremely rare. It extends the classic user path impression to click to purchase by inserting two parallel post-click nodes between click and purchase: Deterministic Action, which merges purchase-related actions like add to cart and add to wish list, and Other Action for remaining post-click behaviors. By defining learning targets on this elaborated behavior graph and training on all impression samples, the method aims to use richer supervision from abundant post-click actions while keeping the CVR estimate applicable to the full impression space.\n\nThe approach formalizes CVR and related targets via conditional probability decomposition over four hidden probabilities: click given impression, DAction given click, purchase given click and DAction, and purchase given click and not DAction. The model architecture mirrors this structure with three modules: a shared embedding module for sparse ID features and numerical features, decomposed prediction modules that estimate the four sub-target probabilities in parallel using MLPs, and a parameter-free sequential composition module that recombines them into final CVR and auxiliary rates such as CTR, click-through DAction rate, and click-through conversion rate. Training minimizes a weighted sum of log losses computed from entire-space targets, with the intermediate losses intended to exploit abundant labeled signals from post-click behaviors and reduce reliance on scarce purchase labels.\n\n*users always take some purchase-related actions after clicking*  \n*we propose a novel idea of post-click behavior decomposition*\n\nExperiments use a large-scale dataset from a major e-commerce platform with over 326 million impressions, about 20.6 million clicks, about 2.5 million DAction events, and about 226.9 thousand purchases. ESM2 is compared against GBDT, a single-task DNN, an oversampled DNN, and ESMM, an existing entire-space multi-task model that uses impression to click to purchase without explicit post-click decomposition. Offline results report AUC, GAUC, and F1 under top-k style thresholds, with ESM2 achieving the best scores and showing notable gains over ESMM in CVR AUC and click-through conversion metrics; the paper notes that small AUC gains can translate to meaningful revenue impact. Online A/B testing in production reports that ESM2 improves CVR over the baselines and yields about a 3 percent CVR lift compared with ESMM, while meeting latency requirements, with an example claim of around 20 ms response time due to parallelizable structure. Additional analyses include ablations on dropout, depth, and embedding size, a finding that normalized continuous feature embeddings outperform discretization, and evidence that combining add to cart and add to wish list into DAction performs better than using either alone, with larger relative gains for users exhibiting more frequent purchasing behavior.",
  "file_path": "/Users/rrp/Documents/aicode/data/papers/ecommerce_evaluation/1910.07099_esmm_cvr.pdf"
}