{
  "paper_id": "2006.00556",
  "title": "Personalized Item Frequency",
  "category": "product_matching",
  "status": "success",
  "summary": "This paper studies next-basket recommendation, where each user action is a basket, meaning a time-ordered sequence of sets rather than a sequence of single items. The authors argue that personalized item frequency, the count of how often a user bought each item, carries critical predictive signals that many RNN-based next-basket models fail to capture and exploit. They identify two key patterns tied to personalized item frequency: repeated purchase behavior within the same user and a collaborative purchase pattern where users with similar frequency profiles tend to buy similar items.\n\n*personalized item frequency information provides two critical signals for NBR.*  \n*existing methods cannot fully exploit the critical signals contained in PIF.*\n\nThey support this with dataset analysis showing the collaborative purchase pattern can cover a large fraction of items in the target basket and often dominates the repeated pattern when using nearest neighbors defined by personalized item frequency vectors. To explain why deep sequential models struggle here, they test RNN modules on a synthetic vector-addition task meant to mirror accumulating frequencies across time and find training converges to high error; they derive a closed-form solution showing representational capacity exists but optimization tends to get stuck away from the desired solution in this recommendation setting. Based on this, they propose a simple neighbor-based model, temporal-item-frequency-based user-KNN, that builds a user vector via hierarchical time-decayed averaging within groups of baskets and across groups, finds k nearest neighbors by Euclidean distance, and predicts by combining the target user vector and the neighbors mean vector with a mixing weight.\n\nExperiments on four public transaction datasets, ValuedShopper, Instacart, Dunnhumby, and TaFeng, evaluate recall and NDCG under a user-level cross-validation protocol. The proposed temporal-item-frequency-based user-KNN generally outperforms multiple baselines and several prior next-basket methods, including deep RNN-based approaches, especially when frequency-driven patterns are strong; on Dunnhumby, results are mixed, with a state-of-the-art neural set model achieving better NDCG while the proposed method is slightly better on recall. Additional analyses show the temporal decay design improves neighbor quality by reducing uncovered target items, the repeated-purchase component is usually the strongest single signal, and combining repeated and collaborative components yields the best results, with performance sensitive to k, grouping, decay ratios, and the mixing weight.",
  "file_path": "/Users/rrp/Documents/aicode/data/papers/product_matching/2006.00556_personalized_item_frequency.pdf"
}