{
  "paper_id": "2006.05639",
  "title": "Lifelong Sequence",
  "category": "product_matching",
  "status": "success",
  "summary": "This paper addresses click-through rate prediction when user histories are extremely long, arguing that simply encoding all lifelong behaviors into fixed-size memory introduces heavy noise and weak item-specific interest matching as sequences grow to ten-thousands. It proposes Search-based Interest Model, SIM, a cascaded two-stage retrieval-and-modeling paradigm that first selects a candidate-related subset of behaviors and then applies a more precise interest model on that reduced sequence, aiming to improve both scalability and accuracy for industrial real-time serving.\n\nSIM consists of a General Search Unit and an Exact Search Unit. The General Search Unit retrieves top-K relevant behaviors from arbitrary-length histories, using either hard-search that filters by the same category as the candidate item or soft-search that ranks behaviors by embedding similarity and uses maximum inner product search with ALSH; the goal is to cut inputs down to hundreds while filtering noise. The Exact Search Unit then models the candidate-to-behavior relationship with attention, including a multi-head attention design and optional time-interval embeddings to reflect that behaviors at different times contribute differently, and the whole system is trained with cross-entropy using a combined loss for the two units.\n\nKey evidence and practical details come from experiments and deployment. Public evaluations use Amazon Books and a Taobao behavior dataset, while an industrial dataset from Alibaba display advertising includes sequences up to 54000 events, with many samples exceeding 10000 events; SIM generally improves AUC over baselines like DIN, DIEN, and MIMN, and adding time information further improves results on Taobao. For online serving, the paper emphasizes latency and throughput constraints and describes an offline-built two-level per-user index called a user behavior tree, keyed by user id then category, scaling to about 22 TB; in production they choose hard-search for efficiency because it performs close to soft-search while avoiding heavier nearest-neighbor search costs. Reported online A/B testing from 2020-01-07 to 2020-02-07 shows business lifts and analysis suggesting SIM shifts recommendations toward longer-term same-category interests.\n\n*SIM has been deployed in the display advertising system in Alibaba, bringing 7.1% CTR and 4.4% RPM lift.*\n\n*serves more than 1 million users per second at a traffic peak.*",
  "file_path": "/Users/rrp/Documents/aicode/data/papers/product_matching/2006.05639_lifelong_sequence.pdf"
}