{
  "paper_id": "2008.08180",
  "title": "Semantic Product Matching",
  "category": "ecommerce_evaluation",
  "status": "success",
  "summary": "This paper tackles semantic product search for matching structured e-commerce catalogs during candidate generation, where the priority is high recall and fast retrieval. It argues product records are more heterogeneous and sparse than web documents because they have multiple structured fields with multi-instance attributes, so single-shot encoding can miss important signals. The core goal is to learn query and product representations that preserve field structure while remaining scalable via precomputed product embeddings.\n\n*In this paper, we propose a new semantic product search algorithm that learns to represent and aggregate multi-instance fields into a document representation*  \n*Multiple fielded representations are encoded to first form document matrix, and matched against query vectors to extract heterogeneous matching signals.*\n\nThe proposed approach uses a Siamese transformer setup with DistilBERT encoders and mean pooling to embed the query and each of 7 product fields, then applies a Structured Matching Module that compares query and field vectors via element-wise subtraction and multiplication, plus an explicit lexical match signal. The product schema includes Title, Description, Category, Metadata, Brand, Numeric attributes, and Product search terms built from top clicked queries, with instances concatenated per field before encoding. Training minimizes binary cross-entropy with Adam and regularization, and the design emphasizes bottom-up aggregation across field instances to better handle long, mixed-attribute product data.\n\nExperiments use two evaluation sources in the home-improvement domain: a large internal click-log dataset converted to binary labels via a click threshold, and the 2016 Kaggle Product Search Relevance dataset with human relevance grades that are also binarized for some tests. Against BM25, BM25F, Arc-II, and Duet, the model reports best overall performance on the PSR test set, including higher NDCG@5, MAP, and MRR than Duet, and ablations show adding fielded structured matching improves MAP and MRR on both PSR and click-log tests while NDCG@1 changes only slightly. An error analysis over 1,000 queries labeled into Brand or Collection, Color or Finish, Unit, Material, Model, and Typo finds unit matching is hardest, structured field matching helps most classes, and typo queries benefit from subword and lexical matching, while some brand and color queries see decreased performance.",
  "file_path": "/Users/rrp/Documents/aicode/data/papers/ecommerce_evaluation/2008.08180_semantic_product_matching.pdf"
}