{
  "paper_id": "2103.12982",
  "title": "Jd Deep Ranking",
  "category": "product_matching",
  "status": "success",
  "summary": "The paper From Semantic Retrieval to Pairwise Ranking Applying Deep Learning in E-commerce Search describes how JD.com applied deep learning to two core stages of e-commerce search: candidate retrieval and candidate ranking. It introduces a Deep Semantic Retrieval system that adds semantic matching beyond exact term overlap, and a Deep Pairwise Ranking system that learns subtle user preferences from large-scale behavioral logs. The authors report meaningful gains in online business metrics and improved offline ranking quality versus traditional approaches like gradient boosted trees.\n\nFor semantic retrieval, Deep Semantic Retrieval encodes queries and items into a shared embedding space using a two-tower neural model trained from click logs plus human supervision, then retrieves the top K nearest items via an embedding index built offline. The system is designed for millisecond-level retrieval at billion-scale, and the paper highlights both quality and efficiency results, including substantial GPU speedups for indexing and serving. Example query cases show the model bridging semantic gaps, including long-tail and Chinese queries that map to relevant products not captured by strict term matching. *GPU achieves~10xspeedup.*\n\nFor ranking, Deep Pairwise Ranking adds a re-ranking stage that scores only the top K items from earlier phases to control compute, motivated by the observation that most engagement concentrates near the top of the list. It trains a Siamese pairwise model on triples of items co-occurring under the same query session, using a mix of hand-crafted numeric features, raw query and item text (unigrams and bigrams), and raw user action sequences represented with embeddings. Offline, it improves sessionAUC and orderNDCG@5 over an XGBoost baseline, and online A/B tests show lifts across core metrics such as UCTR, UCVR, and GMV, with some reported reductions in query rewrite rate and average order position depending on the experiment table. *welearnuser preferencebetweenapairofitemsforagivenquery.*",
  "file_path": "/Users/rrp/Documents/aicode/data/papers/product_matching/2103.12982_jd_deep_ranking.pdf"
}