{
  "paper_id": "2106.09297",
  "title": "Taobao Embedding",
  "category": "product_matching",
  "status": "success",
  "summary": "This paper studies embedding-based retrieval for large-scale e-commerce search in Taobao and reports two practical failure modes observed in production: weak controllability of query relevance and a mismatch between training and inference that hurts retrieval quality over time. It proposes Multi-Grained Deep Semantic Product Retrieval, or MGDSPR, to better align training with top-K retrieval and to increase the share of retrieved candidates that remain usable after relevance filtering, improving both user experience and system efficiency.\n\n*the performance of the EBR system is dramatically degraded due to its:(1) low relevance with a given query*\n\nMGDSPR keeps a two-tower structure for efficient ANN retrieval but strengthens the user side to capture both query meaning and personalized intent. It encodes queries with multiple semantic granularities, then uses attention mechanisms over user behavior sequences split by recency into real-time, short-term, and long-term signals, and fuses these representations with self-attention. For training, it replaces pairwise hinge objectives with softmax cross-entropy to give the model global comparison ability consistent with inference, using sampled softmax for scalability; it also smooths noisy implicit feedback with a temperature parameter and generates relevance-improving hard negatives by interpolating positives with high-scoring random negatives in embedding space.\n\nThe paper also describes an online relevance control module that applies inverted-index boolean matching on key query terms to filter ANN results, aiming to prevent semantically similar but intent-wrong items from reaching ranking. On Taobao logs from December 2020 at industrial scale, MGDSPR improves offline Recall@1000 and substantially raises a relevance good rate proxy, and it converges faster than pairwise loss in reported training curves; deployment uses daily distributed TensorFlow training, multi-column ANN indexing over roughly 100 million items, and low-latency retrieval. In online A/B tests averaged over 10 days in January 2021, it reports gains in both commerce outcomes and relevance, including increased flow into later ranking stages and improved GMV and transactions.\n\n*MGDSPR improves GMV and #Transactions by 0.77% and 0.33%, respectively.*",
  "file_path": "/Users/rrp/Documents/aicode/data/papers/product_matching/2106.09297_taobao_embedding.pdf"
}