{
  "paper_id": "2112.13753",
  "title": "Metacvr",
  "category": "product_matching",
  "status": "success",
  "summary": "MetaCVR presents a conversion rate prediction method for small-scale recommendation scenarios where Data Distribution Fluctuation is severe: models often need months of data, creating a mismatch between training and online serving, and promotions can abruptly change behavior patterns, making the next period uncertain. The paper frames different time periods as different occasions and uses metric-based meta learning to transfer knowledge across these occasions with limited per-occasion samples. *We treat time periods with different data distributions as different occasions.*\n\nThe approach has three main parts: a Feature Representation Network that is pre-trained on multi-month data, a Distance Metric Network that measures how close a sample is to each occasion prototype, and an Ensemble Prediction Network that combines the base model signal with distance-derived signals for final CVR prediction. Occasions are defined as Before-Promotion, During-Promotion, After-Promotion, and Not-Promotion, with positive and negative prototypes per occasion computed as mean feature vectors of support sets produced by the frozen representation network. For distance metrics, the paper compares fixed distances with learnable metrics and proposes a trainable space-projection distance metric plus an alternative neural-network distance metric, arguing learnable metrics better fit the nonlinear representation space.\n\nExperiments use real e-commerce logs from 2021-01-15 to 2021-03-31, split into a training set, a validation set, and a recent-period set for training the metric and ensemble components. Offline evaluation uses AUC, and online A/B testing reports PCVR and GMV; MetaCVR achieves the best offline AUC reported in the table and is the top online method, outperforming strong baselines including XGBoost and representative deep CVR methods such as DCN, ESMM, ESM2, and ESDF. *Online A/B test also shows our model achieves impressive gains of 11.92% on PCVR and 8.64% on GMV.* The paper concludes that explicitly modeling distribution discrepancy and promotion-driven uncertainty via occasion prototypes and learnable distance metrics is effective, and suggests future work combining this approach with entire-space modeling and time-delay factors.",
  "file_path": "/Users/rrp/Documents/aicode/data/papers/product_matching/2112.13753_metacvr.pdf"
}