{
  "paper_id": "2210.10309",
  "title": "Multi Objective Recsys",
  "category": "ecommerce_evaluation",
  "status": "success",
  "summary": "This survey argues that optimizing a recommender system for a single objective like offline relevance accuracy is often insufficient in practice, because real deployments must balance multiple, frequently competing goals. It motivates multi-objective recommender systems as a way to align recommendations with diverse notions of value, including beyond-accuracy quality (such as diversity or novelty), business goals, and longer-term user outcomes. *being accurate is not enough*\n\nIt proposes a taxonomy of multi-objective settings that are largely orthogonal and can co-occur: recommendation quality objectives at the individual level (multi-criteria decision making, constraint-based recommendation, preference relaxation, and calibration that matches recommendation distributions to user profiles) and at the aggregate level (balancing accuracy with diversity, novelty, serendipity, coverage, popularity bias, or fairness). It also covers multistakeholder objectives (consumer vs provider trade-offs like relevance vs profit, profit-aware recommendation, group recommendation as preference aggregation, reciprocal recommendation for two-sided matching, and marketplace exposure constraints), time-horizon objectives (short-term KPIs like CTR or revenue vs long-term retention and satisfaction, with discussion of longitudinal effects and reinforcement learning, simulators, and bias in offline evaluation), user experience objectives (UI trade-offs such as information completeness vs overload, transparency and control vs cognitive effort, and flexibility vs efficiency in conversational systems), and system objectives (model complexity, scalability, maintenance costs, and the sometimes limited practical returns of highly sophisticated models). *a multi-objective recommender system (MORS) is a system designed to jointly optimize or balance more than one optimization goal.*\n\nThe challenges section emphasizes that deciding the right balance is fundamentally organizational and requires clear KPIs, proxy measures, and validation that optimized metrics correspond to real-world goals. It criticizes common research abstractions and warns that metric improvements may not translate to better user experience or business impact without user studies and industry collaboration, drawing parallels to abstraction traps in related sociotechnical research. It highlights fairness as especially difficult to operationalize meaningfully and calls for more human-in-the-loop evaluation, field studies, and better surrogate measures for long-term objectives, concluding that multi-objective recommender systems remain an important area with open research questions.",
  "file_path": "/Users/rrp/Documents/aicode/data/papers/ecommerce_evaluation/2210.10309_multi_objective_recsys.pdf"
}