{
  "paper_id": "2212.14464",
  "title": "Diversity Survey",
  "category": "ecommerce_evaluation",
  "status": "success",
  "summary": "This survey argues that optimizing only relevance in retrieval systems can harm both users and providers: users can receive redundant results that limit exploration and long term satisfaction, while providers can face exposure concentration that reinforces a superstar economy. It frames diversity as a core objective in both search and recommendation, and positions diversification as a way to satisfy varied user needs while improving marketplace health through broader item exposure. *We are the first to propose a unified taxonomy for classifying the metrics and approaches of diversification in both search and recommendation.*\n\nThe paper first clarifies diversity concerns in each setting. For search, it distinguishes extrinsic diversity, which addresses uncertainty in what a query means or what the user intends, versus intrinsic diversity, which treats non redundancy as part of the information need even for a single intent. For recommendation, it separates individual-level diversity, focused on avoiding redundant items within each user list, from system-level diversity, focused on the aggregate breadth of items exposed across all users and tied to provider side fairness. *System-level diversity is not a simple average of individual-level diversity across all customers.*\n\nIts main contribution is a unified taxonomy of metrics and methods that spans both domains. Metrics are grouped into relevance-oblivious and relevance-aware families: distance-based measures such as intra-list average or minimal distance with cosine, Jaccard, or Gower style distances; coverage-based measures that track breadth of items or subtopics, with both rank-unaware and rank-aware variants like subtopic coverage, subtopic recall, and related quantities; and social welfare style measures such as Simpson diversity index and Gini index for exposure inequality. Relevance-aware metrics combine relevance with novelty or intent coverage, including alpha-nDCG, NRBP, nDCU, intent-aware IA-family formulations that weight per intent relevance, and D-family and D# variants that address normalization and encourage intent recall. For improving diversity, approaches are organized as offline pre-processing, in-processing, and post-processing: examples include predefining user types, sampling strategies for graph based models, constructing diversity constrained training labels, adding diversity as regularization or as part of the scoring function, and reranking with greedy methods like MMR or set based methods like DPP, plus refinement strategies that swap or adjust items to increase diversity while controlling relevance loss. It also surveys online approaches via bandits and reinforcement learning, covering both diversity as a scoring component and architectures designed to ensure category coverage, and closes with open directions such as time dependent diversity, direct metric optimization, diversity in explainability, multi stakeholder tradeoffs, multi modal recommendation, links to fairness, and practical challenges introduced by LLM based recommendation setups.",
  "file_path": "/Users/rrp/Documents/aicode/data/papers/ecommerce_evaluation/2212.14464_diversity_survey.pdf"
}