{
  "paper_id": "2306.05118",
  "title": "Paper",
  "category": "mini_program_service",
  "status": "success",
  "summary": "This paper introduces controllable multi-objective re-ranking CMR for the final stage of industrial recommender systems, where a ranked list must balance competing goals such as relevance and diversity. The core problem is that common linear scalarization methods typically bake fixed preference weights into a static model, making online changes slow because they require retraining, even though optimal weights can vary by user group and by time or scenario. CMR addresses this by taking preference weights as a runtime control signal so the serving system can adjust tradeoffs immediately.\n\nCMR combines a hypernetwork with a re-ranking model: the hypernetwork maps the current preference-weight vector to a small set of weight-sensitive parameters, while most model parameters remain shared and unchanged to keep deployment feasible. The proposed re-ranking model follows an Actor-Evaluator framework, where the actor generates a list and the evaluator scores it using multiple utility functions. The actor uses an encoder-decoder design with a DeepSet encoder for order-insensitive candidate representation and a PointerNet-style sequential decoder with local-context enhanced attention; masking enforces constraints such as no reselection and strict fixed-position insertion. The evaluator aggregates multiple list-representation channels and supports both model-predicted engagement utilities and analytical business utilities, with the paper emphasizing four recurring business task types that can be combined in one end-to-end objective. *Weclassifybusiness-orientedtasksintofourmaincategories:fixed-position insertions, flow control, diversity, and group ordering.*\n\nTraining is described as conditional: preference weights are sampled from a feasible distribution during offline learning, the evaluator is trained first with supervised signals, and the actor is trained with a REINFORCE-style policy gradient objective using logged exposure lists for an advantage-like baseline, with practical notes such as gradient clipping and Thompson sampling for action selection. Offline experiments on the LibRerank benchmark with an advertising dataset test CMR on multiple sequential re-ranking backbones and compare against rule-based controllable baselines, showing controllable tradeoffs where higher accuracy preference increases MAP and NDCG while decreasing diversity metrics, and highlighting stronger diversity performance and smoother control behavior for CMR. Online experiments in a Taobao Subscribe scene demonstrate that increasing a utility weight tends to increase its corresponding online metric, and a 7-day A/B test comparing a multi-module pipeline baseline to a single CMR solution reports relative improvements including content clicks per user 0.62 percent, seller exposure number per user 2.43 percent, coldstart exposure ratio 4.27 percent, chronological ordering 1.40 percent, stay time per user 1.41 percent, and content exposure number per user 0.73 percent. *Thispaperpresentsacontrollablemulti-objectivere-ranking(CMR) frameworktoadapttherecommendationre-rankingmodelsac- cordingtothepreferenceweightsinadynamicmanner,avoiding thecostsofre-trainingthemodels.*",
  "file_path": "/Users/rrp/Documents/aicode/data/papers/mini_program_service/2306.05118_paper.pdf"
}