{
  "paper_id": "2308.11939",
  "title": "Retail Forecasting",
  "category": "ecommerce_evaluation",
  "status": "success",
  "summary": "This paper studies how adding macroeconomic indicators to retail sales time series affects demand forecasting accuracy, arguing that many retail-forecasting studies rely too heavily on historical sales alone. Using Walmart US data, the authors enrich item-level demand records with Consumer Price Index, Index of Consumer Sentiment, and unemployment rates, then compare multiple regression and machine learning models trained with and without those macro variables. The central claim is that external economic conditions have explanatory power for future demand and can improve forecast performance across several model families, not just neural networks.\n\nThe dataset preparation focuses on a five-year Walmart dataset covering 3,049 products across 10 stores in CA, TX, and WI, with calendar and pricing information merged in, and then macroeconomic series appended from sources including World Bank WDI and the University of Michigan. The analysis uses a filtered subset centered on store CA_1 and emphasizes reducing noise by excluding older transactions before a cutoff to keep training signals more contemporary. Feature engineering adds date-derived indicators, imputes missing prices, and constructs lag and rolling statistics (notably a 28-day lag plus rolling means and standard deviations over multiple windows), alongside month, weekday, and item identifier indicators.\n\nFive models are evaluated: Lasso, Ridge, LightGBM, XGBoost, and Decision Tree, with performance measured by MAE and RMSE on held-out test data. Adding macro variables generally yields modest improvements for Lasso, Ridge, LightGBM, and XGBoost, while Decision Tree slightly worsens; LightGBM shows the clearest gains in the reported comparison table. A feature-importance analysis over 100 items (131 total features) is used to support the explanatory role of macro indicators, with models’ top features lists including at least one macroeconomic variable such as ICS or CPI, alongside dominant lagged and rolling demand features and item identifiers.\n\n*The models were trained and tested both with and without additional macroeconomic features to assess the impact on predictive accuracy.*\n\n*Overall, the findings suggest that macroeconomic indicators meaningfully enhance retail sales forecasting performance for machine learning algorithms.*",
  "file_path": "/Users/rrp/Documents/aicode/data/papers/ecommerce_evaluation/2308.11939_retail_forecasting.pdf"
}