{
  "paper_id": "2308.11998",
  "title": "Economic Recsys",
  "category": "ecommerce_evaluation",
  "status": "success",
  "summary": "This systematic review surveys Economic Recommender Systems, recommender approaches that explicitly incorporate monetary considerations such as price, profit, and related economic and marketing concepts to more directly optimize an organization’s profitability. It follows a PRISMA-style selection process and identifies 135 relevant studies (published since 2000) from major digital libraries plus citation chasing, arguing that the literature is broad but scattered and that economic objectives create important multi-stakeholder tensions. *An Economic Recommender System ECRS is an RS that exploits price and profit information and related concepts from marketing and economics to directly optimize an organization’s profitability.*\n\nThe paper proposes a taxonomy with five dimensions of analysis, grouped into customer-oriented vs organization-oriented approaches, and notes that methods appear both as in-processing models (economic goals built into objectives or learning) and post-processing re-rankers (heuristics layered on top of any baseline). Key dimensions are:\n- **Price sensitivity**: model user price preferences and willingness to pay using MF variants, context-aware methods, or GNN-based graphs with user, item, and price nodes; plus re-ranking that weights predicted interest by price-sensitivity signals.\n- **Economic utility modeling**: adapt utility functions from economics (multi-attribute utility, diminishing marginal utility and repurchase cycles, complementary or substitutable products, utility per dollar) to redefine what the system should optimize beyond relevance scores.\n- **Profit awareness**: directly push recommendations toward higher-margin outcomes via association-rule weighting, graph and social-link value models, learning-to-rank, multi-objective evolutionary methods, or re-ranking that multiplies predicted interest by profit with constraints to protect relevance.\n- **Promotional strategies**: incorporate discounting, personalized pricing ideas, bundling with pricing models, and brand-awareness style tactics tied to funnel stages.\n- **Long-term value sustainability**: optimize long-run outcomes like customer lifetime value using heuristics, supervised learning with survival-style signals, and reinforcement learning that targets long-horizon reward proxies such as engagement or allocated action value.\n\nFor evaluation, the review finds offline testing dominates, typically mixing relevance metrics (Precision, NDCG, MRR) with value metrics that multiply hits by price or profit (Revenue@k, Profit@k, expected profit variants, and price-weighted ranking gains), but it emphasizes that business-value evaluation lacks standardization and comparability across papers. It summarizes online evidence from field tests and user studies as generally showing sizable KPI lifts, while warning that many tests are short, baselines can be proprietary, and assumptions like synthetic profit distributions are common because public datasets rarely include true cost or profit fields. Reproducibility is flagged as a major gap, with few studies sharing code and uneven coverage across subareas. *Only a very small subset of 15 articles, out of 135 share the implementation code.*",
  "file_path": "/Users/rrp/Documents/aicode/data/papers/ecommerce_evaluation/2308.11998_economic_recsys.pdf"
}