{
  "paper_id": "2309.06882",
  "title": "Promap",
  "category": "product_matching",
  "status": "success",
  "summary": "## Summary\n\nThis paper introduces ProMap, two new manually curated datasets for product mapping in e-commerce, where the task is to decide whether two listings from different e-shops refer to the same product. The authors argue that many existing datasets are either incomplete, missing key product information like specifications and images, or unrealistic because their non-matching pairs are too dissimilar, making models look strong in benchmarks but weak in real scenarios with near-duplicate products. ProMapCz contains 1,495 Czech product pairs from Alza.cz and Mall.cz, and ProMapEn contains 1,555 English product pairs from Walmart.com and Amazon.com, each including rich text fields plus images, prices, and source URLs.\n\n*Existing datasets often suffer from incomplete product information or contain only very distant non-matching products.*  \n*Additionally, the non-matching products were selected in two phases, creating two types of non-matches – close non-matches and medium non-matches.*\n\nThe datasets are built by sampling products across 10 categories, scraping all available product attributes, then manually finding for each source product a match, a close non-match, and a medium non-match on the target site under explicit similarity constraints. Close non-matches must share brand, have similar names, and be within about 20 percent price difference, while medium non-matches remain same-brand and similar in name and price but can differ more in specifications. The resulting label distribution is roughly one third matches, one third close non-matches, and one third medium non-matches, with category-level counts reported and some noted difficulty differences, such as fewer laptop matches in ProMapCz due to inventory differences between the Czech retailers.\n\nFor baselines, the authors preprocess images and text to compute a 34-feature similarity vector per pair, then train standard classifiers including logistic regression, SVM, decision trees, random forests, and neural networks. Images are cropped via object detection and compared using perceptual hashing with Hamming-distance-based matching, while text fields are cleaned, lemmatized for Czech using Majka, vectorized with tf-idf, and compared with cosine similarity; additional Jaccard-style similarities are computed for detected keyword sets such as IDs, brands, numbers, units, and descriptive terms, plus special handling for structured specifications including unit normalization. Neural networks achieve the best reported F1 scores on ProMapCz and ProMapEn, and results are substantially higher on adapted versions of Amazon-Walmart and Amazon-Google, supporting the claim that ProMap is harder; further analysis shows close non-matches are more difficult than medium non-matches, and Czech models outperform English ones, with several possible explanations suggested and future work focused on dataset expansion and improved preprocessing and modeling.",
  "file_path": "/Users/rrp/Documents/aicode/data/papers/product_matching/2309.06882_promap.pdf"
}