{
  "paper_id": "2312.07482",
  "title": "Retail Classification",
  "category": "product_matching",
  "status": "success",
  "summary": "This paper tackles a practical grocery e-commerce data problem for Midiadia, a Spanish company that extracts label and packaging text but still manually assigns each new product to a 3-level food taxonomy. It proposes automating the lowest level, Variety, using only textual attributes from the product itself, aiming to reduce time and errors in maintaining a fast-changing product catalogue. *This paper introduces a solution to automatically categorize the constantly changing product catalogue into a 3-level food taxonomy.*\n\nThe study compares three families of methods and implements four classifiers: a score-based probabilistic ranking approach using a modified BM25 formulation, traditional machine learning with KNN and fuzzy KNN, XGBoost, and a deep neural network using a multilayer perceptron. The dataset starts from 31,193 products and is cleaned to 20,888 items (MDD-DS) using selected fields centered on food identity, with taxonomy sizes of 16 categories, 62 subcategories, and 159 varieties; preprocessing merges Name, Legal Name, and Ingredients into one description, lowercases text, removes numbers, stop words, punctuation, extra spaces, and duplicates, then builds a bag-of-words representation with 11,359 unique words. For KNN, FKNN, XGBoost, and MLP, dimensionality is reduced via PCA (tested 400 to 800 components, with 600 components retaining about 0.847 variance), and for nearest-neighbor methods the best-performing distance metric across Top_1, Top_2, and Top_3 settings is Spearman.\n\nResults are reported under three operating modes: Top_1 returns one best variety, Top_2 returns two candidates, and Top_3 returns three candidates for expert review. Key outcomes include:\n- BM25 score-based method: accuracy 0.833 for Top_1, 0.920 for Top_2, 0.948 for Top_3\n- FKNN best overall for Top_1 with accuracy 0.8459 (PCA 800), and strong for Top_2 and Top_3 with accuracy 0.9153 and 0.9413 (both best at PCA 600)\n- KNN peaks at accuracy 0.8427 for Top_1 (PCA 700), 0.8874 for Top_2 (PCA 600), and 0.9201 for Top_3 (PCA 400)\n- XGBoost underperforms the others, topping out at accuracy 0.7071 for Top_1, 0.8126 for Top_2, 0.8568 for Top_3 (best at PCA 400)\n- MLP is competitive, with best accuracy 0.8388 for Top_1 and 0.8436 for Top_2 and Top_3 (best at PCA 800), and notably strong F1 in Top_2 and Top_3 (0.9046 and 0.9109 at PCA 800)\n\nThe paper concludes that if Midiadia wants a single automatic label, FKNN is the best choice, but if the workflow benefits from returning 2 to 3 options for final human selection, the modified BM25 ranking performs best and FKNN remains close. *The best in Top_1 is FKNN, closely followed by KNN.* It also outlines next steps including building an ingredients synonym dictionary to handle regulatory wording variation, exploring additional models such as CNN, LSTM, BiLSTM, BERT, and SVM, and leveraging the classification work as a foundation for a multidimensional product recommender that uses ingredients and other nutrition-related attributes.",
  "file_path": "/Users/rrp/Documents/aicode/data/papers/product_matching/2312.07482_retail_classification.pdf"
}