{
  "paper_id": "2401.03218",
  "title": "Miniscope Privacy",
  "category": "mini_program_service",
  "status": "success",
  "summary": "MiniScope is a research tool for finding privacy inconsistencies in MiniApps that run inside SuperApps such as WeChat, where MiniApps can access sensitive resources and data but are hard to analyze due to subpackage loading and event driven callbacks. The paper argues that prior static taint analyses miss code that only appears after runtime navigation and can also over report issues by including unreachable callbacks or orphaned pages, so it introduces a two phase iterative hybrid approach that tightly couples static analysis with guided UI exploration.\n\n*Our empirical evaluation of over 120K MiniApps using MiniScope demonstrates its effectiveness in identifying privacy inconsistencies.* MiniScope first analyzes only the main package, builds a MiniApp Dependency Graph that merges UI State Transition Graph, Callback Control Flow Graph, and cross language data flow, then uses directed UI exploration to load subpackages via a subpackage directed breadth first strategy. It then reanalyzes the now complete package and performs privacy practice directed depth first exploration, using fuzzy matching to map WXML components to runtime UI widgets when conventional UI tooling cannot reliably locate WeChat specific components.\n\nFor privacy inconsistency detection, MiniScope monitors sensitive behaviors by hooking APIs with Frida and reverse engineering the JSBridge path to map MiniApp APIs to underlying Android APIs, then cross validates observed behaviors against privacy policy statements extracted into structured triples using an LLM based few shot prompt method. In a large scale study of 127,460 MiniApps, only 10,786 had valid privacy policies, and among those analyzed the paper reports both over collection and overclaim patterns, plus responsible disclosure outreach to 2,282 developers with 44 acknowledgments; it also discusses limitations such as unpacking failures, restricted UI paths that require special entry points, and residual false positives from path insensitivity. *The results reveal significant issues, with 5.7% of MiniApps over-collecting private data and 33.4% overclaiming data collection.*",
  "file_path": "/Users/rrp/Documents/aicode/data/papers/mini_program_service/2401.03218_MiniScope_Privacy.pdf"
}