{
  "paper_id": "2403.02760",
  "title": "Llm Ecommerce Recommendation",
  "category": "product_matching",
  "status": "success",
  "summary": "This SPIE proceedings paper argues that large language models can address key shortcomings of deep neural network based recommender systems in e-commerce, especially weak natural language understanding, limited generalization to new scenarios, and lack of explicit reasoning and explainability. It frames LLMs as a way to represent items as text, integrate metadata and context via prompts, transfer knowledge across domains for cold start, and produce human-readable recommendation rationales. *LLM can provide understandable explanations of recommendations, enhancing user trust and engagement.*\n\nIt introduces a framework called PALR that combines traditional candidate retrieval from historical user item interactions with an LLM-based ranking stage that selects from provided candidates expressed in natural language. The paper then reviews LLM-driven collaborative filtering enhancements through pre-training, fine-tuning, and prompting, and positions LLMs as enriching feature representations and similarity signals used in user based and item based CF. *we propose a new framework, PALR, which aims to combine historical user behavior (e.g., clicks, purchases, ratings, etc.) with LLM*\n\nMethodologically, it outlines standard CF workflows and similarity computations, then layers in LLM support for more semantically informed similarity and scoring:\n- User based CF: compute user similarity (e.g., cosine similarity, Pearson correlation), choose K nearest neighbors, and predict ratings via weighted deviations with bias adjustment.\n- Item based CF: compute item similarity via co-occurrence and cosine style measures, including adjusted cosine similarity for rating matrices.\n- Evaluation: uses Precision and Recall definitions, and adds coverage as the fraction of product categories represented in recommendations.\n\nIn experiments, the paper compares baseline UserCF vs T-UserCF and ItemCF vs T-ItemCF using mean absolute error across different neighbor counts K. It reports that the LLM-enhanced variants perform better overall, with T-UserCF reaching its lowest MAE at K = 10 while UserCF reaches its lowest at K = 5 and worsens afterward; a table of MAE values is provided for multiple K settings. The conclusion reiterates that combining LLMs with collaborative filtering improves recommendation accuracy and personalization in e-commerce by enabling richer text and semantic signals and better similarity estimation, which is presented as promising for future recommender system design.",
  "file_path": "/Users/rrp/Documents/aicode/data/papers/product_matching/2403.02760_llm_ecommerce_recommendation.pdf"
}