{
  "paper_id": "2403.17344",
  "title": "Entity Matching Llm",
  "category": "product_matching",
  "status": "success",
  "summary": "This paper argues that entity matching in real-world data integration is often less about fuzzy string similarity and more about ambiguity in what a match should mean when external databases differ in granularity and detail. Using an ESG reporting case study, it shows why nearest-neighbor embeddings can return many vaguely related candidates that are hard to interpret, while a naive LLM prompt can be overly strict if it treats match as identical. The core contribution is reframing the task as relation discovery between entities so analysts can navigate a spectrum of acceptable matches with human verification for high-stakes decisions.\n\nThe proposed method extends traditional entity matching from a binary same entity decision to a relation-based matching function that checks whether a source tuple and target tuple satisfy a predefined relation. Relations are not mutually exclusive, can be one-to-many, and often still require postprocessing to pick the best candidate for a downstream task. System design combines offline embedding and indexing of the external table for retrieval speed with an online retrieval augmented generation step: for each input tuple and relation, retrieve K nearest candidates, ask an LLM to decide which candidates satisfy the relation, and present matched entities plus explanations for a human-in-the-loop decision; defaults include K set to 10 and an iterative retrieval heuristic when too few matches are found.\n\nKey relations illustrated for the ESGFlo workflow include:\n- Exactly the same: synonyms or abbreviations of the same entity  \n- General without additional details: a broader category that avoids adding assumptions  \n- Similar with additional details: similar but introduces extra implied features  \n- Similar with wrong details: similar but with contradictory details  \n- Component: parts or constituents of the entity\n\nA pilot think-aloud user study with an analyst reports the relation-based report is intuitive, aligns with how analysts reason, and reduces time spent sifting candidates, while also surfacing limitations from missing domain knowledge and coarse relation definitions. The paper notes review burden when many similar input tuples repeat patterns, and proposes future work to group inputs and reuse prior verification to reduce human effort. *The report that uses relations to match entities is very intuitive in its explanations.* *These reports have significantly reduced our manual efforts.*",
  "file_path": "/Users/rrp/Documents/aicode/data/papers/product_matching/2403.17344_entity_matching_llm.pdf"
}