{
  "paper_id": "2405.10835",
  "title": "Multi Scenario",
  "category": "product_matching",
  "status": "success",
  "summary": "This paper proposes USR, a unified ranking framework that jointly models e-commerce search and recommendation, arguing that standard multi-scenario learning is too coarse to capture key differences between these two scenarios and does not fully exploit label information across scenarios. The core idea is to explicitly learn separate search-view and recommendation-view representations while also leveraging a global label space so signals from one scenario can help the other. The authors report consistent offline gains across multiple backbone multi-scenario models and production improvements after deployment in the 7Fresh app.\n\nUSR adds three main pieces on top of a shared embedding and sequence encoder: (1) an S and R views User Interest Extractor layer that uses a scenario trigger plus dynamic weight re-parameterization to produce distinct user-interest vectors for search and recommendation, with a contrastive loss to separate the two views; (2) an S and R views Feature Generator layer that gates and rescales scenario-agnostic features differently for each view, also trained with a contrastive objective; and (3) a Global Label Space Multi-Task layer that defines a global label as the union of scenario actions and factorizes scenario action probability via conditional probability, training the main scenario task alongside an auxiliary global-label task.\n\n*Online A/B testing also indicates substantial performance gains across multiple metrics.*  \n*Currently, USR has been successfully deployed in the 7Fresh App.*\n\nExperiments use 7Fresh traffic logs from October 1 to December 1, 2023, with CTR and CTCVR as targets and AUC as the primary metric; the dataset includes about 5.3 million search sessions and about 0.54 million recommendation sessions. USR is applied as a universal wrapper over several multi-scenario baselines such as SharedBottom, MMoE, PLE, STAR, M2M, and APG, and improves AUC for both CTR and CTCVR in both scenarios, with ablations showing the largest drop when removing the global-label multi-task component. A one-week online test reports uplifts in both user conversion rate and user click-through rate for search and recommendation, after which the approach is deployed in the production app.",
  "file_path": "/Users/rrp/Documents/aicode/data/papers/product_matching/2405.10835_multi_scenario.pdf"
}