{
  "paper_id": "2407.21022",
  "title": "Retrieval Survey",
  "category": "product_matching",
  "status": "success",
  "summary": "This survey focuses on the retrieval stage of modern recommender systems, the first step in multi stage cascade pipelines that must quickly narrow millions of items to a manageable candidate set for later ranking. It clarifies how retrieval differs from ranking in candidate set size, available features, typical model architectures such as dual tower late interaction, and objectives that prioritize recall and efficiency over fine grained ordering. It also frames real world practice around multi channel retrieval, where several independent retrievers are combined to improve coverage of diverse user interests.\n\n*To achieve precise and efficient personalized retrieval, we summarize existing work in three key areas: improving similarity computation between user and item, enhancing indexing mechanisms for efficient retrieval, and optimizing training methods of retrieval.* The paper organizes methods along three main axes and then drills down into representative families:\n- Similarity learning: shallow collaborative filtering approaches such as user based and item based neighborhood methods, plus matrix factorization and extensions that add side information, temporal dynamics, or richer feature interactions; and deep embedding based retrieval methods including two tower models, autoencoder and variational approaches, graph embedding methods, graph neural network retrieval, MLP based neural collaborative filtering, and multi interest user representations that produce multiple vectors per user.\n- Indexing mechanisms: brute force whole vault scoring, approximate nearest neighbor search using vector indexing and quantization, and tree based indexing methods such as TDM and its successors, plus end to end structure learning approaches like Deep Retrieval.\n- Optimization methods: training design for implicit feedback, especially negative sample construction strategies including static, hard, adversarial, and graph based negatives, along with whole data non sampling alternatives; common losses such as sampled softmax, NCE, and pairwise objectives like hinge loss and BPR.\n\nThe survey also standardizes evaluation with offline metrics such as Recall at K, Precision at K, HR at K, AP, and MAP, and online metrics such as CTR, CVR, RPM, and GMV, then reports benchmark experiments on MovieLens 1M, Amazon Book, and Yelp2018 using a consistent RecBole based setup. Results highlight that no single method dominates across datasets, with RecVAE leading on MovieLens 1M, ItemKNN strongest on Amazon Book, and SGL best on Yelp2018 in their reported runs. A detailed case study describes an end to end retrieval pipeline in a large banking app setting, including offline and nearline retrieval, embedding storage, triggering updates from recent interactions, and a seven channel multi channel design that falls back to popular and user tag based popular retrieval when the first layer returns too few items.\n\n*Multi channel retrieval is widely used in recommender systems, which employs various independent retrieval methods to individually retrieve different subsets of items.* Finally, the paper highlights open challenges and directions: moving from coarse features toward richer interaction patterns within efficient retrieval models, using distillation to transfer knowledge from more expressive models, co designing advanced indexing with model training, studying retrieval as part of the full cascade rather than in isolation, and exploring generative recommendation with large language models through direct generation or selective choice from candidates.",
  "file_path": "/Users/rrp/Documents/aicode/data/papers/product_matching/2407.21022_retrieval_survey.pdf"
}