{
  "paper_id": "2407.11418",
  "title": "Lotus Semantic Operators",
  "category": "mini_program_service",
  "status": "success",
  "summary": "This paper proposes semantic operators, a declarative model for bulk semantic data processing where transformations are specified in natural language but executed with database-style planning and optimization. The core idea is to define each operator’s intended behavior via a tractable, high-quality gold algorithm, then let an optimizer choose cheaper execution plans that still satisfy statistical accuracy targets with a user-chosen failure probability. The work is implemented in an open-source system called LOTUS, aiming to bring model-data independence to AI-based analytics in the same spirit that relational systems provide data independence.\n\n*We introduce semantic operators, the first formalism for declarative and general-purpose AI-based transformations based on natural language specifications*  \n*Our model specifies the expected behavior of each operator with a high-quality gold algorithm, and we develop an optimization framework that reduces cost, while providing accuracy guarantees*\n\nThe model defines operators parameterized by langex, a typed natural-language function signature, evaluated with a world model M. A core set mirrors relational algebra but generalizes beyond row-wise LLM calls, including:\n- `sem_filter`: keep tuples that satisfy a natural-language predicate; gold algorithm runs per-row LLM predicate checks to avoid long-context issues.\n- `sem_join`: keep tuple pairs that satisfy a natural-language predicate; gold algorithm is a nested-loop join with O(N1·N2) LLM calls.\n- `sem_topk`: return k best tuples under a natural-language ranking; gold algorithm uses pairwise LLM comparisons plus quickselect-style selection for parallelizable batching.\n- `sem_agg`: reduce many rows to one via a commutative, associative natural-language reducer; gold algorithm uses hierarchical reduction to manage context limits and quality.\n- `sem_group_by`: discover C semantic groups and label/assign tuples; gold algorithm predicts candidate labels per tuple, clusters embedded labels (k-means), synthesizes group labels, then does LLM-based assignment.\nFor optimization, LOTUS uses proxy-oracle schemes with learned thresholds from sampling to meet precision/recall or classification-accuracy guarantees: filters use a smaller LLM proxy scored via log-probabilities when available; joins use embedding similarity proxies (sim-filter) or an LLM projection followed by similarity (project-sim-filter), choosing the lower-cost plan; group-by accelerates assignments with embedding-similarity gating; top-k improves pivot selection using embedding similarity when correlated, designed to be lossless.\n\nEvaluation covers fact-checking (FEVER), extreme biomedical multi-label classification (BioDEX), search and ranking (BEIR SciFact plus a synthetic HellaSwag-bench), and topic analysis on 647 scraped ArXiv papers. Reported results show LOTUS programs can re-express complex pipelines in under about 50 lines of user code while matching or exceeding strong baselines: for FEVER, a map-search-filter program reaches about 91% accuracy versus FacTool at 80.9% and runs much faster with batching; optimizations retain about 99.8% agreement with the unoptimized LOTUS program while further reducing runtime. For BioDEX, optimized join plans reduce LLM calls by roughly 1000× versus the gold nested-loop join and improve rank-precision relative to embedding-only or UQE-style baselines, while DocETL is reported to have high variance and frequent optimizer failures in their runs. For ranking, pairwise-based top-k is positioned as more reliable than pointwise or listwise LLM ranking on their benchmarks, and the system can rapidly produce interpretable topic labels for unsupervised grouping, with configurable trade-offs between proxy-only speed and oracle-level accuracy via user-set targets and delta.",
  "file_path": "/Users/rrp/Documents/aicode/data/papers/mini_program_service/2407.11418_LOTUS_Semantic_Operators.pdf"
}