{
  "paper_id": "2409.07829",
  "title": "Ui Automation Wechat",
  "category": "mini_program_service",
  "status": "success",
  "summary": "The paper presents CAT, a hybrid approach for cost-effective mobile UI automation testing that combines retrieval-augmented LLM prompting with machine-learning-based UI element mapping, validated in an industrial WeChat setting. CAT runs in two phases: task description decomposition, where RAG retrieves the most similar prior testing example to use as one-shot context for generating an executable action sequence, and UI automation execution, where actions are aligned to on-screen UI elements with an ML matcher plus an LLM optimizer for semantic mismatch cases. *achieving 90% UI automation with $0.34 cost, outperforming the state-of-the-art.*\n\nFor decomposition, task descriptions are embedded using a transformer encoder model and retrieved by cosine similarity to select representative examples; the LLM is prompted to output numbered, bracketed actions that can be parsed with regular expressions. For execution, UI elements and target elements are encoded and matched via cosine similarity with a threshold to detect likely mismatches; when mismatches arise, an LLM is prompted over a simplified XML view hierarchy produced by a depth-first traversal heuristic that collapses trivial nested layouts. Implementation uses ChatGPT for the LLM component, Genymotion for Android virtualization, UIAutomator for view-hierarchy dumps, and ADB to execute operations.\n\nEvaluation uses a WeChat dataset of 39,981 developer-written task descriptions spanning 24 development cycles, split by app activities to avoid leakage into a 2,010-task test set and a 37,971-task retrieval set. Key results reported include:\n- CAT completion rate: 90% at $0.34 average LLM cost and about 2.65 minutes per task\n- Ablations: 0-shot RAG at 50% completion, N-shot RAG at 66% with higher cost, no optimizer at 52%, and LLaMA70B at 71%\n- State of the art comparison: Seq2Act at 35% completion with higher time, AdbGPT at 90% completion but $1.07 average cost, while CAT maintains 90% at lower cost and reports $1,467 cost savings versus the best baseline setup\n\nIn an industrial deployment, CAT is integrated into the WeChat testing platform and triggered for new features or releases, with additional bug detection via crash-log heuristics and prior UI display and functional bug detection techniques. During December 2023 to June 2024, it automatically executes over 6,300 task descriptions with an 88% completion rate and detects 141 developer-validated bugs, and the discussion argues this hybrid design improves robustness and cost compared to LLM-only automation while remaining adaptable to other industrial apps given common testing dataset practices. *CAT is integrated into the internal UI automation process and is activated whenever new features are proposed or a new app version is released*",
  "file_path": "/Users/rrp/Documents/aicode/data/papers/mini_program_service/2409.07829_UI_Automation_WeChat.pdf"
}