{
  "paper_id": "2410.21237",
  "title": "Hierarchical Kg Images",
  "category": "product_matching",
  "status": "success",
  "summary": "## Summary\n\nThis paper proposes a fully automated pipeline for constructing structured, hierarchical e-commerce product knowledge graphs using only raw product images. The core idea is to combine a vision-language model to extract rich image-grounded descriptions with a large language model to format, infer missing attributes, and expand category hierarchies, producing schema-compliant graphs that can be updated quickly as inventories change. The authors also release a small human-annotated dataset to benchmark product property extraction for this setting, and report consistent gains over a modified prior zero-shot baseline.\n\nThe method is organized into an initialization phase and a per-product enrollment cycle. Initialization selects target product properties and builds a schema that assigns each property a data type such as string, numeric, or a fixed set of choices, with automatic unit prediction for numeric fields and choice-list generation for categorical fields. Enrollment then processes each product through four steps: extract an unstructured multi-turn description from the image using InternVL2-8B with schema-augmented prompting; use Llama3.1-70B plus constrained generation via SGLang to reason about ambiguous or non-visible attributes and emit strictly schema-following JSON; hierarchically expand links (especially category) by inserting intermediate nodes so products connect through multiple abstraction levels; and prune redundancy by merging semantically identical nodes that differ only by word order or casing. The design emphasizes linear scaling per added product, enabling large-inventory growth without per-item cost increasing with graph size.\n\nExperiments use 105 valid Walmart-sourced product images (from an initial 120), resized to 448×448, with manual labels for four categorical properties and one numerical property: Category, Primary Package Color, Package Material, Package Shape, and Weight. The baseline adapts an AutoKG-style approach by prompting the VLM to produce triples using property names as predicates, with an additional baseline variant that prepends the schema description. Results show large improvements from schema prompting alone and further gains from the full pipeline; the complete method achieves the best reported performance across all properties, including substantial lifts on Category and notable improvements on Weight using accuracy@threshold metrics. Ablations indicate the reasoning step is particularly important for Weight standardization and material inference, and multi-turn extraction helps capture extra visual cues that improve downstream inference.\n\n*We propose a novel method that fully automatically generates a knowledge graph from scratch using only image data.*\n*Our method outperforms our baseline in all metrics and evaluated properties, demonstrating its effectiveness and bright usage potential.*",
  "file_path": "/Users/rrp/Documents/aicode/data/papers/product_matching/2410.21237_hierarchical_kg_images.pdf"
}