{
  "paper_id": "2504.05310",
  "title": "Grit Graph Recall",
  "category": "product_matching",
  "status": "success",
  "summary": "This paper targets first-stage retrieval in e-commerce search pipelines, where high recall is critical because missed relevant products cannot be recovered by later filtering, ranking, or reranking stages. It argues task-oriented e-commerce queries are especially difficult due to context-heavy, action-driven intent, and it contributes both a new benchmark and a retrieval-time recall booster that can sit on top of many first-stage retrievers. *GRIT leads to robust and statistically significant improvements over state-of-the-art lexical, dense, and learned-sparse baselines.* *During retrieval, it locates neighbors with higher contextual and action relevance and prioritizes them over the less relevant candidates from the initial retrieval.*\n\nThe benchmark, TQE, is built from the ESCI Product Search dataset by generating task-oriented versions of existing English US-locale queries using GPT-4o mini, plus an LLM-based consistency validation loop that repeats generation until the task-oriented query preserves the original requirements. TQE includes 22472 English queries, with both small and large query sets released, and a manual spot check on 100 query pairs reports 98 preserve the same requirements while all 100 are task-oriented. Across four first-stage baselines, the paper reports a consistent recall drop when moving from traditional ESCI queries to their task-oriented counterparts, averaging about 5.9 percent on the small set and 6.2 percent on the large set.\n\nGRIT itself has an offline indexing step and a lightweight retrieval-time step. At indexing time it builds a weighted product product similarity graph from training relevance annotations, using only products labeled Exact, Substitute, or Complement and ignoring Irrelevant; edge weights accumulate over co-occurrences, with higher weights for more-relevant label pairings such as Exact Exact above Exact Substitute above Exact Complement, while Complement Complement is intentionally low. At retrieval time, GRIT takes the top t percent of the initial results as seed nodes, scores neighbor products by summed edge weights to the retrieved set, and replaces the bottom b percent of initial results with the highest-scoring neighbors, keeping the candidate set size unchanged to avoid added downstream latency. Experiments on BM25, TAS-B, TCT-ColBERT-HNP, and SPLADE++ show statistically significant recall gains on both traditional and task-oriented queries, including reported improvements up to 6.3 percent, with best performance around t equal to 0.02 and b saturating near 0.3; the conclusion suggests extending the approach to tasks requiring purchase of multiple products.",
  "file_path": "/Users/rrp/Documents/aicode/data/papers/product_matching/2504.05310_grit_graph_recall.pdf"
}