{
  "paper_id": "2506.21368",
  "title": "Real Time Recommendation",
  "category": "product_matching",
  "status": "success",
  "summary": "The paper presents a real-time, personalized recommendation methodology for large fashion e-commerce platforms, targeting very low latency during browsing while staying scalable and continually responsive to stock and changing user intent. It frames the core challenge as simultaneously achieving near-instant recommendations, mitigating cold start, and enabling continual updates with constrained compute, validated on one proprietary dataset and the public H&M Kaggle dataset. The work is an authors version accepted for ICANN 2025, with the final version to appear in Springers LNCS proceedings.\n\nThe approach builds a heterogeneous product graph where nodes are items and edges connect items co-interacted by users across four event types: co-clicked, co-favorite, co-cart, and co-purchased, with edge weights reflecting interaction intensity. Each item starts from a visual embedding produced by a pretrained ResNet-18 on product images, then a Heterogeneous GNN is trained self-supervised with a contrastive objective to produce structural embeddings that reflect multi-relational interaction patterns; this GNN serves as a teacher for knowledge distillation into a lightweight student MLP that maps only image embeddings into the teachers space. For personalization, each user gets a personal copy of the student MLP that is continually fine-tuned online: the users current representation is an exponential moving average of their interacted items, and periodic updates run a few SGD steps on a triplet-style loss that pulls positive interactions toward a weighted centroid while pushing away negative examples drawn from recommended but ignored items, with recommendations produced via K nearest neighbors in the learned embedding space. *user-tailored recommendations in the order of 1ms (on CPU) and with limited memory fingerprint (700kb).*  *requiring on average less than 100ms to complete adaptation (on CPU).*\n\nExperiments simulate temporal streaming with train, validation, and test splits, predicting the next purchases using Precision, Recall, and F1 with K set to 10 and T set to 12, and comparing against Last-K, LightGCN, and PinSage under a standardized session-based evaluation protocol. On the proprietary e-commerce dataset, the best reported setting is HGNN plus 1 week personalization, improving F1 versus both LightGCN and PinSage, while results on the public dataset show the adapted variants surpass the best public solution, with gains limited by the public data containing only purchase events. An ablation study indicates both graph pretraining and continual personalization contribute materially, and it also observes that a simple CNN-EMA baseline can exceed LightGCN on recall, suggesting visual features are particularly important in this fashion setting; the appendices add implementation details such as neighbor sampling to keep memory bounded, an example deployment schedule for refreshing global and user models, and the hyperparameter grid used, including a consistent choice of Euclidean distance for similarity.",
  "file_path": "/Users/rrp/Documents/aicode/data/papers/product_matching/2506.21368_real_time_recommendation.pdf"
}