{
  "paper_id": "2508.15217",
  "title": "Multi Attribution Cvr",
  "category": "product_matching",
  "status": "success",
  "summary": "The paper argues that conversion rate prediction in large-scale online marketing systems is tightly coupled to the attribution mechanism used to create training labels, yet production models typically train on only one primary attribution view and discard complementary signals from other views. It proposes Multi-Attribution Learning, or MAL, to jointly learn from multiple attribution perspectives while still optimizing a chosen primary target for deployment. *we propose a novel Multi-Attribution Learning MAL framework for CVR prediction that integrates signals from multiple attribution perspectives*\n\nMAL has two main parts: an Attribution Knowledge Aggregator that multi-task learns CVR under multiple mechanisms and extracts conversion knowledge vectors from per-mechanism towers, and a Primary Target Predictor that fuses this knowledge with standard features to predict the primary target with calibrated probabilities. It also introduces Cartesian-based Auxiliary Training, CAT, which forms an auxiliary multi-class task from the Cartesian product of binary labels across attribution mechanisms, adding a higher-order supervision signal to enrich the learned knowledge. Experiments use Taobao click logs (two months train, next day test), evaluate with weighted AUC and GAUC, and compare against a single-attribution production baseline plus common multi-task baselines.\n\nEmpirically, MAL improves offline ranking metrics and online business outcomes: with last-click as primary target it reports +0.51% GAUC and +0.14% AUC over the baseline, and with MTA as primary target it reports +0.75% GAUC and +0.21% AUC, outperforming Shared-Bottom, MMoE, PLE, and HoME. Ablations attribute gains to multi-attribution information rather than parameter count, with AKA providing most of the lift and CAT adding additional GAUC gains; performance improvements correlate with increased positive samples under alternative attributions and are larger for long conversion-path, high unit-price industries such as large home appliances and jewelry. *MAL model delivers an overall 2.7% lift in GMV a 1.2% rise in BuyCnt and a 2.6% increase in ROI*",
  "file_path": "/Users/rrp/Documents/aicode/data/papers/product_matching/2508.15217_multi_attribution_cvr.pdf"
}