{
  "paper_id": "2509.11079",
  "title": "Difficulty Aware Orchestration",
  "category": "mini_program_service",
  "status": "success",
  "summary": "This paper introduces Difficulty-Aware Agentic Orchestration DAAO, a framework that dynamically generates a query-specific multi-agent workflow instead of relying on static, one-size-fits-all pipelines that can over-process easy queries or underperform on hard ones. The core idea is to predict each query’s difficulty and use that signal to scale workflow depth, select which reasoning or collaboration operators to use, and route each operator to an appropriate LLM, explicitly balancing accuracy against inference cost.\n\n*We propose generating adaptive workflow strategies guided by query difficulty.* DAAO is built from three tightly coupled modules: a variational autoencoder based difficulty estimator that learns a latent difficulty embedding and decodes a scalar difficulty score, a modular operator allocator that constructs a layered DAG workflow with depth adapted by difficulty, and a cost and performance aware LLM router that assigns heterogeneous models to selected operators. The system uses workflow success or failure as feedback to adjust difficulty estimates over time, encouraging simpler workflows after success and more complex ones after failure.\n\n*Experiments across six benchmarks show that DAAO outperforms existing multi-agent and routing systems, achieving upto 11.21% higher accuracy with up to 36% lower cost.* Evaluations span math reasoning GSM8K and a harder MATH subset, code generation HumanEval and MBPP, multitask knowledge MMLU, and tool-augmented general assistant tasks GAIA; results report consistent accuracy gains over prompting baselines, autonomous workflow frameworks such as ADAS, AFlow, and MaAS, and LLM routers such as PromptLLM, RouteLLM, and MasRouter. The paper also reports cost reductions on MATH relative to AFlow and MaAS, shows ablations where removing difficulty awareness hurts both accuracy and efficiency most, and includes sensitivity analysis for key parameters such as maximum layers, the utility cost tradeoff coefficient, sampling count, and the operator activation threshold.",
  "file_path": "/Users/rrp/Documents/aicode/data/papers/mini_program_service/2509.11079_Difficulty_Aware_Orchestration.pdf"
}