{
  "paper_id": "2511.11017",
  "title": "Ai Agent Kg Construction",
  "category": "product_matching",
  "status": "success",
  "summary": "This paper proposes a fully automated framework that uses LLM-powered AI agents to build product knowledge graphs for e-commerce directly from unstructured product descriptions, aiming to reduce manual ontology design and rule-based extraction. The core contribution is a three-stage, agent-orchestrated pipeline that produces a product ontology and then populates an RDF knowledge graph with instance data, targeting semantic coherence, scalability, and minimal redundancy while avoiding reliance on predefined schemas.\n\nThe methodology is organized into: ontology creation and expansion, ontology refinement, and knowledge graph population. In creation and expansion, the system samples representative product descriptions and has an agent extract classes, attributes, and relationships into RDF/Turtle, including domain, range, and descriptive comments that specify expected value formats and units; it then iteratively expands the ontology with additional samples until schema growth plateaus. Refinement feeds the complete ontology back to an LLM to suggest merges, splits of compound attributes, tightened constraints, and clearer comments to improve generality and reduce redundancy. Population uses the refined ontology plus each product description to generate RDF triples only when values are explicitly stated, with instructions to respect units and formats and translate values into English when needed.\n\nEvaluation is performed on a real-world dataset of 291 air conditioner product descriptions, using coverage and qualitative quality checks for the ontology plus automated measures for KG population. The resulting ontology has 42 classes and 69 properties, and manual review reports it is modular, hierarchically structured, extendable, with minimal redundancy and no major inconsistencies. The pipeline successfully processes 282 of 291 descriptions, producing 7,459 RDF triples and instantiating 97.1% of ontology properties, with nine failures attributed to invalid RDF outputs. The conclusion highlights the approach as a practical foundation for scalable product intelligence use cases like search, recommendation, analytics, and catalog enrichment, and suggests extensions such as multimodal inputs, fine-tuned or hybrid pipelines for higher accuracy, domain expansion with compliance considerations, and continuous updates from streaming product data.\n\n*The framework achieves over 97% property coverage and minimal redundancy, validating its effectiveness and practical applicability.*\n\n*Triples are only generated when values are explicitly available in the description, avoiding hallucination or inference beyond the provided data.*",
  "file_path": "/Users/rrp/Documents/aicode/data/papers/product_matching/2511.11017_ai_agent_kg_construction.pdf"
}