{
  "paper_id": "2602.15682",
  "title": "User Centric Agent",
  "category": "ecommerce_evaluation",
  "status": "success",
  "summary": "The paper argues that today’s large-scale digital services remain fundamentally platform-centric, optimizing for engagement, retention, conversion, and revenue in ways that often diverge from what benefits users. It claims that even as LLMs improve service quality, a platform optimized for platform goals cannot simultaneously act as a trusted agent for user goals, so the next paradigm should shift to user-centric agents that are owned and controlled by users. It frames this as newly feasible due to advances in LLM intent reasoning and on-device intelligence, and positions the core problem as structural rather than merely technical.\n\nIt explains the platform-centric paradigm and its evolution across data pipelines, model frameworks, and inference strategies, but emphasizes three persistent bottlenecks: fragmented context across apps and private device signals, limited execution boundaries confined to a single platform, and misaligned incentives that shape defaults and outcomes. It then proposes a practical edge cloud implementation model: an on-device personal agent that builds holistic context and enforces user constraints, paired with a cloud service layer that returns candidates, tools, and execution interfaces with interpretable rationales so final decisions and verification remain on device. The proposed on-device lifecycle is organized around Perception and Memory, Intent Decomposition and Planning, and Execution and Evolution, with memory described as tiered and consolidating over time to improve future decisions without exporting raw private context.\n\n*The only lasting solution is governance.*  \n*A more capable model is not a more benevolent model.*\n\nAdoption, the paper argues, depends on ecosystem governance and contracts rather than model capability alone, focusing on who provides and controls the agent, how users can inspect and override preferences, and how users can switch providers without losing personal state. It calls for coordination mechanisms between agents and platforms, including standardized intent and constraint schemas, auditability and verifiable compliance, and economic settlement for attribution and revenue sharing so platforms have incentives to expose reliable intent-level APIs. It also contrasts two alternative directions it sees in current systems: system-level context-driven agents that can access broad context but lack deep, reliable execution, and service-level execution-driven agents that can execute well inside an app but remain contextually isolated from cross-app and device-level signals.",
  "file_path": "/Users/rrp/Documents/aicode/data/papers/ecommerce_evaluation/2602.15682_User_Centric_Agent.pdf"
}